{"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post$ hexo new &quot;My New Post&quot; More info: Writing Run server$ hexo server More info: Server Generate static files$ hexo generate More info: Generating Deploy to remote sites$ hexo deploy More info: Deployment","link":"/2022/09/06/hello-world/"},{"title":"Music Record - ACG OST","text":"This is a record for part of my music, most of which are from ACG OST (Original Soundtracks) from Japanese. I have spent quite a few time to collect, organize and rate these music and it really bothered me twice to lose my record for them. Also, I’ve been putting quite a bit of energy and time configuring foobar2000 to make it convenient to use. Finally I managed to find a great way to keep a record backup of my music so that I am no longer afraid of migrating to another PC or lose my record by accident, and I decide to write an article to keep a record for both my usage of foobar2000 and my music record. TODO","link":"/2022/09/10/music-record/"},{"title":"Miscellaneous Notes","text":"Miscellaneous notes during the use of this blog. This is a personal notes that keeps track of all procedure, problems, tricks, etc. during the building and writing process of this blog. Hopes it will help someone, at least me, when I’d like to migrate to another blog or unfortunately I have to re-build my blog. Building NotesInstalling hexo is quite simple: just install it through npm. At 2022-09-06, the newest version of hexo is fully compatible with my workaround: Windows 11 + WSL 2 Ubuntu 20.04 LTS Node.js v18.x To install Node.js on Ubuntu, follow the official guide of installing Node.js binary distribution, where the commands are already included below. shell123curl -fsSL https://deb.nodesource.com/setup_18.x | sudo -E bash -sudo apt-get install -y nodejsnpm install -g hexo-cli Initialize a Blog RepositoryFollowing the hexo official guide, run shell123hexo init &lt;folder&gt;cd &lt;folder&gt;npm install Personally, I put my blog folder in ~/blog/, which is put in github repo hexo-blog. TODO: I am planning to use Github Action with hexo to publish my blog automatically on site fallcicada.github.io. Customization in BlogAs often mentioned in Chinese SNS, the end of customization is the default. I do not want to put much focus on the customization part of the blog. Except for a clean hexo theme Icarus, I only uses a few additional plugins which are essential in building my blog, currently only including hexo-pdf. Hexo Theme IcarusTo install hexo theme Icarus, follow its Readme or its guide. Some possible dependencies should also be installed together. 12npm install -S hexo-theme-icarus hexo-renderer-infernohexo config theme icarus This will automatically modify your _config.yml, and will also create another theme-specific configuration file _config.icarus.yml at the same directory. Unlisted configuration is kept the same as default. The highlight config should be carefully checked, as I have met several bugs due to inappropriate settings under this part. To ensure that 2 enters break a line rather than 1 enter, set marked.gfm: true in the config file, as in 回车就是换行和预览不一致异常问题. _config.yml >folded123456789101112131415161718192021222324252627# Basic Informationtitle: FallCicada's Blogsubtitle: ''suffix: FallCicadadescription: FallCicada's Personal Blogkeywords: - FallCicada - Blogauthor: FallCicadalanguage: entimezone: America/Los_Angelesurl: 'https://fallcicada.github.io/'highlight: enable: true line_number: true auto_detect: false tab_replace: marked: gfm: true pedantic: false sanitize: false tables: true breaks: false smartLists: true smartypants: true modifyAnchors: '' autolink: true As for Icarus-specific config, I removed a lot of unnecessary component, as noted below. Additionally, the logo, or any other image that needs to be placed in the website template, should be put in directory &lt;icarus directory&gt;/source/img/xxx, and be indexed as /img/xxx in config file. The directory of Icarus, installed directly through npm, should be &lt;blog directory&gt;/node_modules/hexo-theme-icarus. _config.icarus.yml >folded123456789101112131415161718192021222324252627282930# Modified configlogo: /img/kaltsit_sticker.pnghead.favicon: /img/kaltsit_sticker.pngnavbar.links.My GitHub.url: https://github.com/FallCicadasidebar.left.sticky: trueplugins.katex: true# Commented out confighead.manifesthead.open_graphhead.structured_datahead.rsscommentdonatewidgets.profile.author_titlewidgets.profile.social_linkswidgets.linkswidgets.categorieswidgets.subscribe_emailwidgets.adsensewidgets.followitplugins.baidu_analyticsplugins.bing_webmasterplugins.busuanziplugins.cnzzplugins.cookie_consentplugins.google_analyticsplugins.hotjarplugins.statcounterplugins.twitter_conversion_tracking Page LayoutTo modify the page layout, follow the layout guide of Icarus theme. Personally, I modified the &lt;icarus_directory&gt;/layout/layout.jsx and &lt;icarus_directory&gt;/common/widgets.jsx to have a narrower widget column and wider content column. /layout/layout.jsx123456789 &lt;div class={classname({ column: true, 'order-2': true, 'column-main': true, 'is-12': columnCount === 1,- 'is-8-tablet is-8-desktop is-8-widescreen': columnCount === 2,- 'is-8-tablet is-8-desktop is-6-widescreen': columnCount === 3+ 'is-8-tablet is-9-desktop is-9-widescreen': columnCount === 2,+ 'is-8-tablet is-9-desktop is-7-widescreen': columnCount === 3 /layout/common/widgets.jsx1234567891011 function getColumnSizeClass(columnCount) { switch (columnCount) { case 2:- return 'is-4-tablet is-4-desktop is-4-widescreen';+ return 'is-3-tablet is-3-desktop is-3-widescreen'; case 3:- return 'is-4-tablet is-4-desktop is-3-widescreen';+ return 'is-3-tablet is-3-desktop is-2-widescreen'; } return ''; } As Icarus uses the 12 columns system of bulma, the total width of the same type needs sum up to 12. For example, the modification above makes the width of widget column and content column in double-column desktop mode from 4:8 to 3:9. Additional PluginsCurrently I am only installing hexo plugin hexo-pdf for rendering my CV, which could be installed by npm install --save hexo-pdf. It supports both external links and relative file path with the pdf file placed locally. Note that when referring to a local pdf file, the root directory for its path is the same as the root directory of the markdown file. For example, the following formats are all valid: 123{% pdf https://blablabla/test.pdf %}{% pdf https://drive.google.com/file/d/xxxx/preview %}{% pdf /&lt;path&gt;/test.pdf %} Writing BlogI am simply using VSCode + Markdown to write my blog. That’s the easiest but most effecient way for me. Deploying BlogTODO More styles I plan to add some stickers to my blog. It is worth to try to find a way like pattern matching and replacing to save the time of manually adding stickers in in-line form in my blog. Move my personal note from local onto the blog might be a good choice. Also planning to share some of my music records, especially those in foobar2000, as I recently found a great way to backup my musics. No other plans? I think the above plans are enough for a short-term workload lol.","link":"/2022/09/10/misc-note/"},{"title":"Blog Writing Notes","text":"This is some notes during my blog-writing procedure. I will keep some interesting tricks, plugins, or tools inside this notes. Post TemplatesHexo guide Bulma活用 Bulma 美化 Icarus 文章 Tag PluginsTag Plugins","link":"/2022/09/10/blog-writing-notes/"}],"tags":[{"name":"Miscellaneous","slug":"Miscellaneous","link":"/tags/Miscellaneous/"},{"name":"Notes","slug":"Notes","link":"/tags/Notes/"},{"name":"Music","slug":"Music","link":"/tags/Music/"},{"name":"ACG","slug":"ACG","link":"/tags/ACG/"},{"name":"OST","slug":"OST","link":"/tags/OST/"},{"name":"Record","slug":"Record","link":"/tags/Record/"}],"categories":[{"name":"Miscellaneous","slug":"Miscellaneous","link":"/categories/Miscellaneous/"},{"name":"Music","slug":"Music","link":"/categories/Music/"}],"pages":[{"title":"About","text":"This page contains only my Github page and my CV! I will find another time to complete this page. Personal CV","link":"/about/index.html"},{"title":"文章分类","text":"","link":"/categories/index.html"}]}